wedding-wallet-backend/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def current_user
      if decode_token
        user_id = decode_token[0]['user_id']
        @user = User.find_by(id: user_id)