wedding-wallet-backend/app/controllers/api/v1/budgets_controller.rb

INSERT INTO "budgets" ("amount", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["amount", "20000.0"], ["user_id", 5], ["created_at", "2021-07-21 14:30:20.726399"], ["updated_at", "2021-07-21 14:30:20.726399"]]
INSERT INTO "budgets" ("amount", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["amount", "100000.0"], ["user_id", 11], ["created_at", "2021-07-21 14:22:47.908003"], ["updated_at", "2021-07-21 14:22:47.908003"]]
---
    def create
        budget = Budget.create(user: current_user, amount: params[:amount])
        if budget.save

SELECT "budgets".* FROM "budgets" WHERE "budgets"."id" = $1 LIMIT $2  [["id", 42], ["LIMIT", 1]]
UPDATE "budgets" SET "amount" = $1, "updated_at" = $2 WHERE "budgets"."id" = $3  [["amount", "100.0"], ["updated_at", "2021-07-23 16:03:40.076544"], ["id", 42]]
---
    def update
        budget = Budget.find(params[:id])
        budget.update(amount: params[:newAmount])