wedding-wallet-backend/app/controllers/api/v1/categories_controller.rb

    def index
        categories = Category.all
---
SELECT "categories".* FROM "categories"

    def show
        category = Category.find(params[:id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]