wedding-wallet-backend/app/controllers/api/v1/expenses_controller.rb

    def create
        category = Category.find(params[:category])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]