wedding-wallet-backend/app/controllers/api/v1/expenses_controller.rb

    def create
        category = Category.find_by(name: params[:category])
        expense = Expense.create(user: current_user, name: params[:name], amount: params[:amount], category: category, notes: params[:notes])
        if expense.save
---
SELECT "categories".* FROM "categories" WHERE "categories"."name" = $1 LIMIT $2  [["name", "Accomodation"], ["LIMIT", 1]]
INSERT INTO "expenses" ("category_id", "user_id", "amount", "name", "notes", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["category_id", 19], ["user_id", 12], ["amount", "10.0"], ["name", "hotel 4"], ["notes", "notes for 4"], ["created_at", "2021-07-26 17:14:55.567949"], ["updated_at", "2021-07-26 17:14:55.567949"]]
INSERT INTO "expenses" ("category_id", "user_id", "amount", "name", "notes", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["category_id", 4], ["user_id", 11], ["amount", "450.0"], ["name", "hamptons"], ["notes", "bach notes"], ["created_at", "2021-07-24 23:05:50.842571"], ["updated_at", "2021-07-24 23:05:50.842571"]]

    def show
        expense = Expense.find(params[:id])
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]

    def destroy
        expense = Expense.find(params[:id])
        expense.destroy
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" = $1 LIMIT $2  [["id", 39], ["LIMIT", 1]]
DELETE FROM "expenses" WHERE "expenses"."id" = $1  [["id", 39]]